#include "maps.h"
//#:壁、P:プレイヤー、B:箱、G:ゴール
char maps[][MAP_H][MAP_W] = {
    {
        "    #####        ",
        "    #   #        ",
        "    #B  #        ",
        "  ###  B###      ",
        "  #  B  B #      ",
        "### # ### #######",
        "#   # ### ##  GG#",
        "# B  B      P GG#",
        "##### #### #  GG#",
        "    #      ######",
        "    ########     ",
    },
    {
        "####",
        "#G #",
        "#BP#",
        "#  #",
        "####",
    },
    {
        // ここに次のマップのデータを追加することができます
    }
};
